---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Space.LimitOffset
source: html/d8eaf3f7-e891-9ddf-b025-3318a49f7005.htm
---
# Autodesk.Revit.DB.Mechanical.Space.LimitOffset Property

Get or set the Limit Offset of the Space.

## Syntax (C#)
```csharp
public double LimitOffset { get; set; }
```

## Remarks
This property is used to get or set the Limit Offset of the Space.